[
  {
    "title": "Global Tech Summit 2025 Begins in Silicon Valley",
    "description": "Industry leaders and innovators gather to discuss the future of AI, blockchain, and green tech in this year’s highly anticipated summit.",
    "url": "#"
  },
  {
    "title": "Historic Climate Agreement Signed by 190 Countries",
    "description": "Nations commit to aggressive carbon reduction targets after weeks of negotiation in Geneva’s international climate summit.",
    "url": "#"
  },
  {
    "title": "Breakthrough in Cancer Research Offers New Hope",
    "description": "Scientists at the University of Oxford have developed a new treatment showing promising results in early-stage clinical trials.",
    "url": "#"
  },
  {
    "title": "NASA Confirms Water Reserves on Mars",
    "description": "New satellite imagery reveals substantial ice deposits beneath the Martian surface, reigniting hopes for future colonization.",
    "url": "#"
  },
  {
    "title": "Stock Markets Rally After Inflation Drops",
    "description": "Global markets respond positively to lower-than-expected inflation data from the U.S. and Europe.",
    "url": "#"
  },
  {
    "title": "India Launches Its First AI-Powered Satellite",
    "description": "ISRO successfully launches a satellite capable of real-time Earth monitoring using AI-driven analytics.",
    "url": "#"
  },
  {
    "title": "Electric Vehicle Sales Surge in 2025",
    "description": "A 40% year-over-year increase in EV sales highlights a major shift in consumer preferences toward sustainability.",
    "url": "#"
  },
  {
    "title": "Scientists Clone Endangered Snow Leopard",
    "description": "In a groundbreaking experiment, researchers clone a snow leopard to help preserve the species.",
    "url": "#"
  },
  {
    "title": "New Legislation Targets Data Privacy in Tech",
    "description": "Governments pass stricter regulations to protect users from data misuse by big tech companies.",
    "url": "#"
  },
  {
    "title": "Breakthrough Battery Technology Promises Week-Long Phone Use",
    "description": "Silicon-based batteries tested with early results showing triple the life of current lithium-ion cells.",
    "url": "#"
  },
  {
    "title": "World’s Largest Floating Solar Farm Completed",
    "description": "Located in Singapore, this new solar farm powers over 100,000 homes while conserving land space.",
    "url": "#"
  },
  {
    "title": "AI Beats Human in Multilingual Translation Test",
    "description": "An advanced language model outperformed professional translators in 10 global languages.",
    "url": "#"
  },
  {
    "title": "New Vaccine Shows Promise Against All COVID Variants",
    "description": "Researchers unveil a universal COVID-19 vaccine with cross-variant protection.",
    "url": "#"
  },
  {
    "title": "Google Launches Wearable AI Assistant",
    "description": "The AI-powered smart band can summarize conversations, translate languages, and monitor health.",
    "url": "#"
  },
  {
    "title": "Oceans Warming at Alarming Rate, Says UN",
    "description": "New report highlights unprecedented warming of oceans with devastating impact on marine life.",
    "url": "#"
  },
  {
    "title": "Cyberattack Shuts Down Major Power Grid",
    "description": "A coordinated cyberattack leaves millions without power in Eastern Europe.",
    "url": "#"
  },
  {
    "title": "Tesla Reveals Self-Charging Electric Car",
    "description": "Tesla unveils a concept car with solar panels that can charge itself while driving.",
    "url": "#"
  },
  {
    "title": "Quantum Computing Breakthrough Achieved by MIT",
    "description": "The latest quantum chip can perform tasks previously thought impossible.",
    "url": "#"
  },
  {
    "title": "World's First Carbon-Negative Country Announced",
    "description": "Bhutan officially declared the first country to remove more carbon than it produces.",
    "url": "#"
  },
  {
    "title": "AI Detects Diseases from Voice in New Research",
    "description": "Machine learning models accurately diagnose health conditions using voice analysis.",
    "url": "#"
  },
  {
    "title": "New York Bans Gas Cars Starting 2030",
    "description": "Legislation passed to fully transition to electric vehicles by the end of the decade.",
    "url": "#"
  },
  {
    "title": "SpaceX Plans Civilian Moon Base by 2028",
    "description": "Elon Musk outlines ambitious vision for permanent human presence on the moon.",
    "url": "#"
  },
  {
    "title": "Record-Breaking Heatwaves Sweep Across Europe",
    "description": "Cities across Europe report temperatures exceeding 45°C in historic heatwave.",
    "url": "#"
  },
  {
    "title": "Facebook Rebrands to Meta Connect",
    "description": "Meta introduces a new identity for its social networking platform to focus on VR.",
    "url": "#"
  },
  {
    "title": "WHO Approves First Malaria Vaccine for Children",
    "description": "A milestone in public health, the new vaccine is expected to save millions of lives.",
    "url": "#"
  },
  {
    "title": "Bitcoin Crosses $100,000 for First Time",
    "description": "The cryptocurrency hits a historic high amid widespread institutional adoption.",
    "url": "#"
  },
  {
    "title": "China Debuts First Fully Automated City",
    "description": "From transport to governance, AI powers every aspect of daily life in NeoShenzhen.",
    "url": "#"
  },
  {
    "title": "Global Unemployment Hits Lowest Rate Since 2000",
    "description": "Job growth surges in tech and healthcare sectors globally.",
    "url": "#"
  },
  {
    "title": "Twitter Introduces Audio-Based Social Feed",
    "description": "The new feature allows users to post and consume tweets in voice format.",
    "url": "#"
  },
  {
    "title": "Scientists Create Synthetic Leaf That Produces Oxygen",
    "description": "The innovation may provide breathable air in space missions or polluted cities.",
    "url": "#"
  },
  {
    "title": "UN Declares 2025 Year of Sustainable Education",
    "description": "Initiatives launched globally to promote environmental awareness in schools.",
    "url": "#"
  },
  {
    "title": "Smart Glasses Replace Smartphones in New Prototype",
    "description": "A startup reveals glasses with holographic display and gesture-based controls.",
    "url": "#"
  },
  {
    "title": "Global Literacy Rate Hits 91% for First Time",
    "description": "UNESCO celebrates milestone achievement in global education.",
    "url": "#"
  },
  {
    "title": "New Earth-Like Planet Found in Nearby Star System",
    "description": "Astronomers discover a potentially habitable planet just 12 light-years away.",
    "url": "#"
  },
  {
    "title": "Medical Drone Delivers Organs Across Cities",
    "description": "First successful drone delivery of a kidney revolutionizes organ transport.",
    "url": "#"
  },
  {
    "title": "Amazon Tests Robot Delivery in Suburban Areas",
    "description": "New robots designed to deliver packages within minutes of online orders.",
    "url": "#"
  },
  {
    "title": "AI Helps Solve 50-Year-Old Mathematical Problem",
    "description": "A neural network assisted researchers in proving a major algebraic conjecture.",
    "url": "#"
  },
  {
    "title": "World’s Tallest Timber Building Completed in Tokyo",
    "description": "The eco-friendly skyscraper uses sustainable wood from local forests.",
    "url": "#"
  },
  {
    "title": "Researchers 3D-Print Human Heart Valve with Cells",
    "description": "New bio-printing method may revolutionize heart transplant procedures.",
    "url": "#"
  },
  {
    "title": "Japan to Host First Fully Virtual Olympics in 2030",
    "description": "Athletes to compete using VR suits from their home countries.",
    "url": "#"
  },
  {
    "title": "World Population Declines for First Time in Modern Era",
    "description": "Global birth rate dips below replacement levels, UN reports.",
    "url": "#"
  },
  {
    "title": "AI-Generated Art Sells for $1.2 Million at Auction",
    "description": "Collectors embrace digital art created by algorithms.",
    "url": "#"
  },
  {
    "title": "EU Approves Universal Basic Income Pilot Program",
    "description": "Selected cities across Europe will test monthly income programs in 2026.",
    "url": "#"
  },
  {
    "title": "Global Coral Reefs Show Signs of Recovery",
    "description": "Conservation efforts show success as reefs begin regenerating.",
    "url": "#"
  },
  {
    "title": "Scientists Decode Dolphin Language Using AI",
    "description": "Breakthrough research paves the way for animal-human communication.",
    "url": "#"
  },
  {
    "title": "Bill Gates Funds Smart Toilets for Global Sanitation",
    "description": "New waterless toilets are being deployed in underserved communities.",
    "url": "#"
  },
  {
    "title": "Netflix Introduces Choose-Your-Own-Ending Series",
    "description": "Interactive content lets viewers decide story outcomes in real time.",
    "url": "#"
  },
  {
    "title": "First Human Brain-Machine Interface Tested",
    "description": "A paralyzed patient successfully controls computer with thought.",
    "url": "#"
  },
  {
    "title": "World’s First Underwater Hotel Opens in Maldives",
    "description": "Guests can now sleep surrounded by marine life in luxury suites.",
    "url": "#"
  }
]
